TI-FIRST/MSP430-Gamepad/driverlib/MSP430F5xx_6xx/adc10_a.c
        HWREG16(baseAddress + OFS_ADC10CTL2) &= ~(ADC10SR);
        HWREG16(baseAddress + OFS_ADC10CTL2) |= samplingRateSelect;
}

//*****************************************************************************
//
//! \brief Sets the high and low threshold for the window comparator feature.
//!
//! Sets the high and low threshold for the window comparator feature. Use the
//! ADC10HIIE, ADC10INIE, ADC10LOIE interrupts to utilize this feature.
//!
//! \param baseAddress is the base address of the ADC10_A module.
//! \param highThreshold is the upper bound that could trip an interrupt for
//!        the window comparator.
//! \param lowThreshold is the lower bound that could trip on interrupt for the
//!        window comparator.
//!
//! \return None
//
//*****************************************************************************
void ADC10_A_setWindowComp(uint32_t baseAddress,
                           uint16_t highThreshold,
                           uint16_t lowThreshold)
{
        HWREG16(baseAddress + OFS_ADC10HI) = highThreshold;
        HWREG16(baseAddress + OFS_ADC10LO) = lowThreshold;
}

//*****************************************************************************
//
//! \brief Returns the address of the memory buffer for the DMA module.
//!
//! Returns the address of the memory buffer. This can be used in conjunction
//! with the DMA to store the converted data directly to memory.
//!
//! \param baseAddress is the base address of the ADC10_A module.
//!
//! \return The memory address of the memory buffer
//
//*****************************************************************************
uint32_t ADC10_A_getMemoryAddressForDMA(uint32_t baseAddress)
{
        return baseAddress + OFS_ADC10MEM0;
}

//*****************************************************************************
//
//! \brief Returns the busy status of the ADC10_A core.
//!
//! Returns the status of the ADC core if there is a conversion currently
//! taking place.
//!
//! \param baseAddress is the base address of the ADC10_A module.
//!
//! \return One of the following:
//!         - \b ADC10_A_BUSY
//!         - \b ADC10_A_NOTBUSY
//!         \n indicating if there is a conversion currently taking place
//
//*****************************************************************************
uint16_t ADC10_A_isBusy(uint32_t baseAddress)
{
        return HWREG16(baseAddress + OFS_ADC10CTL1) & ADC10BUSY;
}

#endif
//*****************************************************************************
//
//! Close the doxygen group for adc10_a_api
//! @}
//
//*****************************************************************************
//Released_Version_4_10_02
